|                                                                                         | Points | Cote | Total | Commentaires                                                                                                                                                                                                                                                                                                                     |
|-----------------------------------------------------------------------------------------+--------+------+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Programmation correcte des fonctionnalités de l’application                             |        |      |       |                                                                                                                                                                                                                                                                                                                                  |
|➤ Architecture modulaire facilitant la réutilisation et les tests (architecture épurée) |        |      |       |                                                                                                                                                                                                                                                                                                                                  |
|• dépendances univoques                                                                |     20 | B    |  16.0 | Votre SourceUtilisateurApi n'implémente pas l'interface SourceUtilisateur et votre PrésenteurCréationCompte utilise directement la classe SourceUtilisateurApi (dépendance dans le mauvais sens).                                                                                                                                |
|• utilisation d'abstractions pour inverser les dépendances                             |     20 | B    |  16.0 | Pour faire un vrai singleton, la méthode getInstance dans vos interacteurs ne doivent instancier l'instance que si elle n'existe pas déjà, sinon elles la retournent (ce n'est pas fait partout)                                                                                                                                 |
|➤ Séparation correcte des responsabilités                                               |        |      |       |                                                                                                                                                                                                                                                                                                                                  |
|• couche de présentation (MVP)                                                         |     10 | B    |   8.0 | package com.example.brawler? Vous auriez dû choisir un meilleur nom de package. Vous avez plus d'une vue par présenteur, normalement c'est un pour un. Votre division du travail entre vue et présenteur est bien; il y a encore un peu trop de logique dans la vue (dans VueProfilModif, l'utilisateur est modifié dans la vue) |
|• couche de traitement (domaine, entités, interacteurs)                                |     10 | B    |   8.0 | Certains interacteurs font plutôt le travail des entités (validation des données)                                                                                                                                                                                                                                                |
|• couche d'accès aux données (DAOs)                                                    |     10 | B    |   8.0 | Des choses comme «catch (IOException JSONException e) { e.printStackTrace(); }», c'est bon pour déboguer, mais c'est tout. Il ne faut pas rattraper les exceptions si on ne sait pas quoi faire avec                                                                                                                             |
|-----------------------------------------------------------------------------------------+--------+------+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Conception correcte des interfaces graphiques                                           |        |      |       |                                                                                                                                                                                                                                                                                                                                  |
|➤ Convivialité                                                                          |      5 | C    |   3.0 | Encore très approximatif, on ne peut pas dire que c'est utilisable.                                                                                                                                                                                                                                                              |
|➤ Validation des entrées                                                                |      5 | C    |   3.0 | Difficile à dire puisqu'on ne voit pas les messages                                                                                                                                                                                                                                                                              |
|➤ Rétroaction                                                                           |      5 | C    |   3.0 | Les messages d'erreur lors de la connexion n'aident pas à savoir ce qui se passe ("0"?)                                                                                                                                                                                                                                          |
|-----------------------------------------------------------------------------------------+--------+------+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Programmation judicieuse des interactions avec l’utilisateur                            |        |      |       |                                                                                                                                                                                                                                                                                                                                  |
|➤ Utilisation de fils esclaves pour toutes les opérations longues                       |     15 | A    |  15.0 | Les «Thread.sleep(0);» c'était dans ma démo pour ajouter un délai articifiel, ce n'est pas utilise dans la réalité.                                                                                                                                                                                                              |
|➤ I18n                                                                                  |      5 | A    |   5.0 |                                                                                                                                                                                                                                                                                                                                  |
|-----------------------------------------------------------------------------------------+--------+------+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Utilisation adéquate des mécanismes de collaboration en équipe                          |        |      |       |                                                                                                                                                                                                                                                                                                                                  |
|➤ Carnet de produit                                                                     |     10 | A    |  10.0 |                                                                                                                                                                                                                                                                                                                                  |
|➤ Récits utilisateurs complets                                                          |     10 | C    |   6.0 | Très inégal                                                                                                                                                                                                                                                                                                                      |
|➤ Établissement des récits à effectuer pour chaque sprint                               |     10 | A    |  10.0 |                                                                                                                                                                                                                                                                                                                                  |
|➤ Utilisation correcte de git                                                           |     10 | A    |  10.0 |                                                                                                                                                                                                                                                                                                                                  |
|-----------------------------------------------------------------------------------------+--------+------+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Pertinence et clarté de la documentation                                                |        |      |       |                                                                                                                                                                                                                                                                                                                                  |
|➤ Documentation du code source                                                          |     10 | D    |   4.0 |                                                                                                                                                                                                                                                                                                                                  |
|-----------------------------------------------------------------------------------------+--------+------+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Validation judicieuse de l’application à l’aide de tests                                |        |      |       |                                                                                                                                                                                                                                                                                                                                  |
|➤ Tests unitaires                                                                       |        |      |       |                                                                                                                                                                                                                                                                                                                                  |
|• exhaustifs, corrects et fonctionnels.                                                |     30 | E    |   0.0 |                                                                                                                                                                                                                                                                                                                                  |
|-----------------------------------------------------------------------------------------+--------+------+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Total                                                                                   |    185 |      |  125. |                                                                                                                                                                                                                                                                                                                                  |
#+TBLFM: @27$2=vsum(@4..@26)
#+TBLFM: @3$4..@27$4='(cond ((string= "" $3) "") ((string= "E" $3) 0.0) (t (format "%2.1f" (* (string-to-number $2) (/ (+ (- 70 (aref $3 0)) (cond ((= (aref (substring $3 -1) 0) ?+) 0.33) ((= (aref (substring $3 -1) 0) ?-) -0.33) (t 0))) 5.0)))))'
#+TBLFM: @27$4=vsum(@4..@27)
